# VolumeOfInterestViewsVisible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..VolumeOfInterestViewsVisible Property
ParameterTypeId Class See Also
---
"Views Visible"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId VolumeOfInterestViewsVisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VolumeOfInterestViewsVisible As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VolumeOfInterestViewsVisible {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace